from string import Template

#### RAG Prompts ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد يقوم بتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك توليد الإجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
    "إذا لم تتمكن من توليد إجابة مناسبة، يمكنك الاعتذار للمستخدم.",
    "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في إجابتك وتجنب المعلومات غير الضرورية."
])
)


#### Document ####

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)


#### Footer ####

footer_prompt = Template(
    "\n".join([
        "بناءً على المستندات المذكورة أعلاه فقط، يرجى توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "## الإجابة:"
    ])
)